# __SQL Exercise__ (Python Connector)
<hr>

#### - Create _connection_ Python with your SQL Database!
#### - Use ``Sakila`` database!
#### - If there isn't ``Sakila`` in your SQL Dataset, follow this guidance: https://dev.mysql.com/doc/sakila/en/sakila-installation.html

___

## Import Libraries

In [3]:
import pandas as pd
import mysql.connector
import sqlalchemy as alc
from sqlalchemy import create_engine

## Create Engine

In [4]:
engine = create_engine('mysql+mysqlconnector://root:rafdyrizq@localhost/sakila')

## ``Tampilkan seluruh tabel di Database Sakila (Full Table)``

In [6]:
query='''
show full tables;
'''
pd.read_sql_query(query,engine)

              Tables_in_sakila  Table_type
0                        actor  BASE TABLE
1                   actor_info        VIEW
2                      address  BASE TABLE
3                     category  BASE TABLE
4                         city  BASE TABLE
5                      country  BASE TABLE
6                     customer  BASE TABLE
7                customer_list        VIEW
8                         film  BASE TABLE
9                   film_actor  BASE TABLE
10               film_category  BASE TABLE
11                   film_list        VIEW
12                   film_text  BASE TABLE
13                   inventory  BASE TABLE
14                    language  BASE TABLE
15  nicer_but_slower_film_list        VIEW
16                     payment  BASE TABLE
17                      rental  BASE TABLE
18      sales_by_film_category        VIEW
19              sales_by_store        VIEW
20                       staff  BASE TABLE
21                  staff_list        VIEW
22                       store  BASE TABLE

In [7]:
query='''
select * from actor limit 5;
'''
pd.read_sql_query(query,engine)

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [8]:
query='''
select * from address limit 5;
'''
pd.read_sql_query(query,engine)

,address_id,address,address2,district,city_id,postal_code,phone,location,last_update
0,1,47 MySakila Drive,None,Alberta,300,,,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 62, 10, 50, 93, 99...",2014-09-25 22:30:27
1,2,28 MySQL Boulevard,None,QLD,576,,,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 142, 16, 212, 223,...",2014-09-25 22:30:09
2,3,23 Workhaven Lane,None,Alberta,300,,14033335568,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 205, 196, 25, 104,...",2014-09-25 22:30:27
3,4,1411 Lillydale Drive,None,QLD,576,,6172235589,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 91, 13, 228, 52, 3...",2014-09-25 22:30:09
4,5,1913 Hanoi Way,,Nagasaki,463,35200,28303384290,"[0, 0, 0, 0, 1, 1, 0, 0, 0, 40, 209, 55, 14, 3...",2014-09-25 22:31:53

In [9]:
query='''
select * from category limit 5;
'''
pd.read_sql_query(query,engine)

   category_id       name         last_update
0            1     Action 2006-02-15 04:46:27
1            2  Animation 2006-02-15 04:46:27
2            3   Children 2006-02-15 04:46:27
3            4   Classics 2006-02-15 04:46:27
4            5     Comedy 2006-02-15 04:46:27

In [10]:
query='''
select * from city limit 5;
'''
pd.read_sql_query(query,engine)

   city_id                city  country_id         last_update
0        1  A Corua (La Corua)          87 2006-02-15 04:45:25
1        2                Abha          82 2006-02-15 04:45:25
2        3           Abu Dhabi         101 2006-02-15 04:45:25
3        4                Acua          60 2006-02-15 04:45:25
4        5               Adana          97 2006-02-15 04:45:25

In [11]:
query='''
select * from country limit 5;
'''
pd.read_sql_query(query,engine)

   country_id         country         last_update
0           1     Afghanistan 2006-02-15 04:44:00
1           2         Algeria 2006-02-15 04:44:00
2           3  American Samoa 2006-02-15 04:44:00
3           4          Angola 2006-02-15 04:44:00
4           5        Anguilla 2006-02-15 04:44:00

In [49]:
query='''
select * from staff limit 5;
'''
pd.read_sql_query(query,engine)

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

In [52]:
query='''
select * from staff_list limit 5;
'''
pd.read_sql_query(query,engine)

,ID,name,address,zip code,phone,city,country,SID
0,1,Mike Hillyer,23 Workhaven Lane,,14033335568,Lethbridge,Canada,1
1,2,Jon Stephens,1411 Lillydale Drive,,6172235589,Woodridge,Australia,2

In [13]:
query='''
select * from customer limit 5;
'''
pd.read_sql_query(query,engine)

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20
2,3,1,LINDA,WILLIAMS,LINDA.WILLIAMS@sakilacustomer.org,7,1,2006-02-14 22:04:36,2006-02-15 04:57:20
3,4,2,BARBARA,JONES,BARBARA.JONES@sakilacustomer.org,8,1,2006-02-14 22:04:36,2006-02-15 04:57:20
4,5,1,ELIZABETH,BROWN,ELIZABETH.BROWN@sakilacustomer.org,9,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [14]:
query='''
select * from film limit 5;
'''
pd.read_sql_query(query,engine)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,None,6,0.99,86,20.99,PG,"{Behind the Scenes, Deleted Scenes}",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,None,3,4.99,48,12.99,G,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,None,7,2.99,50,18.99,NC-17,"{Deleted Scenes, Trailers}",2006-02-15 05:03:42
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,None,5,2.99,117,26.99,G,"{Commentaries, Behind the Scenes}",2006-02-15 05:03:42
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,None,6,2.99,130,22.99,G,{Deleted Scenes},2006-02-15 05:03:42

In [15]:
query='''
select * from film_actor limit 5;
'''
pd.read_sql_query(query,engine)

   actor_id  film_id         last_update
0         1        1 2006-02-15 05:05:03
1         1       23 2006-02-15 05:05:03
2         1       25 2006-02-15 05:05:03
3         1      106 2006-02-15 05:05:03
4         1      140 2006-02-15 05:05:03

In [16]:
query='''
select * from film_category limit 5;
'''
pd.read_sql_query(query,engine)

   film_id  category_id         last_update
0        1            6 2006-02-15 05:07:09
1        2           11 2006-02-15 05:07:09
2        3            6 2006-02-15 05:07:09
3        4           11 2006-02-15 05:07:09
4        5            8 2006-02-15 05:07:09

In [31]:
query='''
select * from film_list limit 5;
'''
pd.read_sql_query(query,engine)

,FID,title,description,category,price,length,rating,actors
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,Documentary,0.99,86,PG,"WARREN NOLTE, OPRAH KILMER, ROCK DUKAKIS, MENA..."
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,Horror,4.99,48,G,"CHRIS DEPP, SEAN GUINESS, MINNIE ZELLWEGER, BO..."
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,Documentary,2.99,50,NC-17,"BOB FAWCETT, CAMERON STREEP, NICK WAHLBERG, RA..."
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,Horror,2.99,117,G,"OPRAH KILMER, FAY WINSLET, KENNETH PESCI, JODI..."
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,Family,2.99,130,G,"GARY PHOENIX, DUSTIN TAUTOU, MATTHEW LEIGH, MA..."

<hr>

## __Soal__

### 1. Tampilkan aktor yang memiliki nama depan ‘Scarlett’!

In [17]:
query='''
select first_name as Nama_Depan, last_name as Nama_Belakang from actor
where first_name='SCARLETT'
;'''
pd.read_sql_query(query,engine)

  Nama_Depan Nama_Belakang
0   SCARLETT         DAMON
1   SCARLETT        BENING

### 2. Tampilkan aktor yang memiliki nama belakang ‘Johansson’!

In [18]:
query='''
select first_name as Nama_Depan, last_name as Nama_Belakang from actor
where last_name='JOHANSSON'
;'''
pd.read_sql_query(query,engine)

  Nama_Depan Nama_Belakang
0    MATTHEW     JOHANSSON
1        RAY     JOHANSSON
2     ALBERT     JOHANSSON

### 3. Berapa banyak nama terakhir aktor (tanpa ada pengulangan/_distint_)?

In [20]:
query='''
select count(distinct(last_name)) as Jumlah_Nama_Terakhir from actor
;'''
pd.read_sql_query(query,engine)

   Jumlah_Nama_Terakhir
0                   121

### 4. Tampilkan 5 nama belakang aktor yang keluar hanya satu kali di database Sakila!¶

In [26]:
query='''
select last_name as Nama_Belakang, count(last_name) as Jumlah from actor
group by last_name
having Jumlah=1
limit 5
;'''
pd.read_sql_query(query,engine)

  Nama_Belakang  Jumlah
0       ASTAIRE       1
1        BACALL       1
2          BALE       1
3          BALL       1
4     BARRYMORE       1

### 5. Tampilkan 5 nama belakang aktor yang keluar lebih dari satu kali di database Sakila!

In [27]:
query='''
select last_name as Nama_Belakang, count(last_name) as Jumlah from actor
group by last_name
having Jumlah>1
limit 5
;'''
pd.read_sql_query(query,engine)

  Nama_Belakang  Jumlah
0        AKROYD       3
1         ALLEN       3
2        BAILEY       2
3        BENING       2
4         BERRY       3

### 6. Tahun berapa film ‘Academy Dinosaur’ di-_release_?

In [28]:
query='''
select title as Judul, release_year as Tahun_Release from film
where title='Academy Dinosaur'
;'''
pd.read_sql_query(query,engine)

              Judul  Tahun_Release
0  ACADEMY DINOSAUR           2006

### 7. Berapa rata-rata durasi film di database Sakila?

In [29]:
query='''
select avg(length) as Rata_Durasi from film
;'''
pd.read_sql_query(query,engine)

   Rata_Durasi
0      115.272

### 8. Tampilkan rata-rata durasi film di tiap kategori film!

In [35]:
query='''
select category.name as Category, avg(film.length) as Rata_Durasi 

from category join film_category
on category.category_id = film_category.category_id
join film
on film.film_id = film_category.film_id

group by category
;'''
pd.read_sql_query(query,engine)

       Category  Rata_Durasi
0        Action     111.6094
1     Animation     111.0152
2      Children     109.8000
3      Classics     111.6667
4        Comedy     115.8276
5   Documentary     108.7500
6         Drama     120.8387
7        Family     114.7826
8       Foreign     121.6986
9         Games     127.8361
10       Horror     112.4821
11        Music     113.6471
12          New     111.1270
13       Sci-Fi     108.1967
14       Sports     128.2027
15       Travel     113.3158

### 9. Tampilkan kategori film yang memiliki rata-rata durasi (_average of length_) di atas rata-rata kategori film lainnya!

  Category Avg_Duration
0   Sports     128.2027
1    Games     127.8361
2  Foreign     121.6986
3    Drama     120.8387
4   Comedy     115.8276

In [44]:
query='''
select category.name as Category, avg(film.length) as Avg_Duration

from category join film_category
on category.category_id = film_category.category_id
join film
on film.film_id = film_category.film_id

;'''
pd.read_sql_query(query,engine)

  Category  Avg_Duration
0   Action       115.272

In [48]:
query='''
select category.name as Category, avg(film.length) as Avg_Duration

from category join film_category
on category.category_id = film_category.category_id
join film
on film.film_id = film_category.film_id

group by category
having avg(film.length) > (select avg(film.length) from film)
order by avg(film.length) desc
;'''
pd.read_sql_query(query,engine)

  Category  Avg_Duration
0   Sports      128.2027
1    Games      127.8361
2  Foreign      121.6986
3    Drama      120.8387
4   Comedy      115.8276

### 10. Berapa banyak customer yang dilayani oleh 2 staff di Sakila Database?

          Staff  Total_Customer
0  Mike Hillyer            8040
1  Jon Stephens            8004

In [54]:
query='''
select staff_list.name as Staff, count(customer.customer_id) as Total_Customer

from staff_list join customer
on staff_list.SID = customer.store_id

group by staff_list.name
;'''
pd.read_sql_query(query,engine)

          Staff  Total_Customer
0  Mike Hillyer             326
1  Jon Stephens             273

In [58]:
query='''
select count(customer_id) from customer ;
'''
pd.read_sql_query(query,engine)

   count(customer_id)
0                 599